<h3>Digimon Masters Online - Engenharia Reversa Pacotes!</h3>

<p>     Tudo que voc&ecirc; ir&aacute; ler aqui &eacute; apenas para aprendizagem, um passa tempo pessoal que &eacute; fazer engenharia reversa,
<br> de qualquer forma vamos a explica&ccedil;&atilde;o de como funciona o dmo.
Primeiro &eacute; necess&aacute;rio saber que o DMO utiliza
<br> tr&ecirc;s servidores, o Login Server, Char Server e World Server, a porta deles s&atilde;o: 7029, 6999 e 7001, esses s&atilde;o <br>
os servidores principais do DMO, vale lembrar que o Login Server vai disponibilizar uma lista de canais(isto &eacute;, char <br>
servers dispon&iacute;veis para o usu&aacute;rio escolher, ent&atilde;o voc&ecirc; ter&aacute; mais de um Char Server na database, irei falar melhor <br>
sobre isso mais na frente.

Obs: &eacute; importante que voc&ecirc; entenda um pouco de hexadecimal e programa&ccedil;&atilde;o antes de <br> prosseguir.
</p>

<h4> Estrutura dos Pacotes </h4>
<p> Os pacotes do Digimon Masters Online tem uma estrutura padr&atilde;o que &eacute;, 2 bytes iniciais que &eacute; o tamanho do pacote<br>
dois bytes que ser&aacute; a "cabe&ccedil;a" do pacote(isto que ir&aacute; indentificar qual pacote estamos trabalhando), antes de qualquer<br>
string que for enviada &eacute; 1 byte que ser&aacute; seu tamanho, ap&oacute;s o fim da string ter&aacute; outro byte que ser&aacute; 0x0 e o final de todo<br>
pacote h&aacute; um checksum, que &eacute; o <b> tamanho do pacote XOR 6716.</b> </p>

<h4> Login Server </h4>

<p> Para o Login Server n&atilde;o teremos muitos pacotes, mas ele tem uma grande import&acirc;ncia ! Assim que o cliente se conecta <br> ao
servidor, o servidor envia um pacote de autentica&ccedil;&atilde;o, o cliente ir&aacute; enviar a autentica&ccedil;&atilde;o e o servidor ir&aacute; enviar a <br>
confirma&ccedil;&atilde;o, ap&oacute;s esses 2 pacotes, o cliente envia o pacote que contem o seu login e senha digitado, o pacote &eacute; de f&aacute;cil<br>
interpreta&ccedil;&atilde;o ( irei falar melhor dele daqui a pouco), ap&oacute;s isso, o servidor deve verificar se a conta existe e retorna alguma <br>
mensagem ao cliente, isto pode ser tanto uma mensagem de senha incorreta ou conta n&atilde;o existe, como os nomes dos canais que <br>
est&atilde;o; dispon&iacute;veis. Na tela de sele&ccedil;&atilde;o de canais, teremos dois pacotes, um que &eacute; o refresh, isto &eacute;, o servidor ter&aacute; que re-enviar<br>
todos os canais atualizados e o outro ser&aacute; quando o cliente escolher um canal, o servidor ir&aacute; ver qual o canal escolhido e ir&aacute; <br>
enviar um pacote com o IP e Porta do Canal escolhido.
<br>
<b> Pacotes : </b><br>
typedef enum PACKET_HEADER { <br>
<br>
	RECV_AUTH_PACKET        = 0x0,<br>
	RECV_CONFIRM_PACKET 	= 0xFFFF,<br>
	RECV_ACCOUNT_PACKET 	= 0xE50C,<br>
	RECV_CHANNEL_PACKET 	= 0xFFFE,<br>
	RECV_REFRESH_PACKET     = 0xA506,<br>
<br>
	SEND_AUTH_PACKET		= 0xFFFF,<br>
	SEND_MENSAGEM_PACKET 	= 0xCEA,<br>
	SEND_CONFIRM_PACKET		= 0xFFFE,<br>
	SEND_INFO_PACKET 		= 0x0385,<br>
	SEND_CHANNEL_PACKET 	= 0xCE6<br>
<br>
};
<br>
<br>
<b>SEND_AUTH_PACKET :</b><br>
PACKET_SIZE(2 bytes) + HEADER(2 bytes) + ?????(2 bytes) + CHECKSUM<br>
<br>
<b>SEND_MENSAGEM_PACKET :</b><br>
PACKET_SIZE(2 bytes) + HEADER(2 bytes) + 0x00000000(4 bytes) + STRING_DA_MENSAGEM(strlen(string) + 1) + ("NULL")(5 bytes) + CHECKSUM<br>
<br>
<b>SEND_CONFIRM_PACKET :</b><br>
PACKET_SIZE(2 bytes) + HEADER(2 bytes) + ?????(4 bytes) + ????(2 bytes) + CHECKSUM<br>
<br>
<b>SEND_INFO_PACKET :</b><br>
PACKET_SIZE(2 bytes) + HEADER(2 bytes) + ACCOUNT_ID(4 bytes) + ACCOUNT_UID(4 bytes) + CHAR_SERVER_IP(strlen(ip)) + PORTA(4 bytes) + CHECKSUM<br>
<br>
<b>SEND_CHANNEL_PACKET :</b><br>
PACKET_SIZE(2 bytes) + HEADER(2 bytes) + NUM_CHANNELS(1 byte) + CHANNEL_ID1(4 bytes) + CHANNEL_NAME(strlen(channel_name)) + ??(2 bytes) + NUM_PLAYERS(1 byte)<br>
(Se tiver mais canais, continua ChannelID + Channel Name + ?? + N&uacute;mero de Players)<br>
+ ACCOUNT_NAME ?(strlen(acc_name)) + CHECK_SUM<br>
<br>
Esses s&atilde;o os pacotes que o servidor ir&aacute; enviar para o cliente, caso o checkSum ou o tamanho esteja incorreto, o pacote apenas ser&aacute; descartado !<br>




